artillery/phases.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 20
      arrivalRate: 10
      name: "Warming up"
    - duration: 40
      arrivalRate: 20
      rampTo: 2
      name: "Ramping up"
    - duration: 60
      arrivalRate: 40
      name: "Sustained load"
  processor: "./processor.js"
  
scenarios:
  - name: "Sign up flow"
    flow:
      - get:
          url: "/"
      - post:
          url: "/signup"
          beforeRequest: generateSignupData
          json:
            email: "{{ email }}"
            password: "{{ password }}"